const swiper = new Swiper('.swiper', {
    // Optional parameters
    
    loop: true,
  
    // If we need pagination
    pagination: {
      el: '.swiper-pagination',
    },
  
    // Navigation arrows
    navigation: {
      nextEl: '.swiper-button-next',
      prevEl: '.swiper-button-prev',
    },
  
    // And if we need scrollbar
    scrollbar: {
      el: '.swiper-scrollbar',
    },

    effect: "coverflow",
    coverflowEffect: {
        rotate: 20,
        stretch: 50,
        slideShadows: true,

    },
  });

  const buttons = document.querySelectorAll(".asks__button");
  buttons.forEach(button => {
    button.addEventListener("click", function() {
      
      button.classList.toggle("active");
      
    });
  });
  
  const buttons2 = document.querySelectorAll(".why__button");
const block = document.querySelector(".why__block");
let isBlockVisible1 = false;
let currentTex1 = "";

buttons2.forEach(button => {
  button.addEventListener("click", function(event) {
    if (button.getAttribute("data") === "it") {
      currentText1 = "Якщо чесно, найголовніша причина, чому я вступив в бест, це можливість зробити свій внесок у щось велике. Весь час я тільки й робив, що писав якийсь код, щоб здати це викладачу й отримати нещасну оцінку. Я хочу зробити те, чим будуть користуватися інші люди,  те, що зможе їх розвинути або допомогти їм. Для мене це шанс, стати кращим розробником, який нарешті зможе досягти своєї мрії. І я це зроблю не один, а з нашою командою! Ми зробимо все, щоб цей BEC 2024 був найкращим, найуспішнішим та незабутнім з усіх що було раніше!\n\nІ щоб ці слова втілити у реальне життя, я вивчу всі технології які мені треба знати для реалізації наших ідей, якщо треба буде, заб’ю на всілякі тусовки, університет та не буду спати ночами(навіть зможу вкрасти йоржик з якось пабу).";
    } else {
      currentText1 = "Коли я попав в бест, однією з бажаних посад в кортімі була саме логістика, тому що під час рекрутменту, була дана тема з проблемою, де треба було оперативно вирішити проблеми з транспортом, їжею, ночівлею та місцем проведення події. Як для мене, вести переговори з людьми, аналізувати різні події, бачити процес руху послуг або товарів, документувати кожні витрати це тяжка але дуже цікава робота. Я би хотів здобути навички в цій сфері, щоб в майбутньому їх використати в якомусь стартапі або бізнесі. Я готовий вивчити всі потрібні для цього матеріали, щоб бути логістом на якого можна покластися, навіть якщо в останній момент плейс для проєкту по тим чи іншим причинам не буде придатним, я зроблю все, щоб знайти інший.";
    }

    if (isBlockVisible1 && currentText1 === block.textContent) {
      block.classList.add("hidden");
      isBlockVisible1 = false;
    } else {
      block.classList.remove("hidden");
      block.textContent = currentText1;
      isBlockVisible1 = true;
    }
  });
});


  const buttons3 = document.querySelectorAll(".knowledge__button");
  const block2 = document.querySelector(".knowledge__block");
  let isBlockVisible = false;
  let currentText = "";
  
  buttons3.forEach(button => {
    button.addEventListener("click", function(event) {
      if (button.getAttribute("data") === "it") {
        currentText = "Насамперед я пройшов КТ у Боді Вівчара, Віктора Гаврилюка та Володимира Гутовського.<br><br>З основного, найголовніші мої таски, це зробити веб-сторінку самого івенту, брошуру та бота в телеграм, також якщо буде, то сайт для розіграшів. Для веб-сайтів треба буде використовувати React, TypeScript, Tailwind, Redux, Next.js, телеграм бота можна писати як на Python, так і на JS (особисто я хочу повторити ідею Віктора з минулого BEC і зробити все-таки на JS, використовуючи Node.js та telegraf).  <br><br>Мені треба буде зробити своє планування. Не менш головне - це тісно комунікувати з піарником та дизайнером, бо основна моя робота залежить від них. З дизайнером мені треба буде обговорити вид сайту на телефонах, планшетах та ноутах. В ідеалі зробити особистий час з піарником, дизайнером, МО та мною, щоб детально все обговорювати, бо в чаті нашого івенту інформація може загубитись.  <br><br>Також мені доведеться підтримувати свою команду в технічних питання, наприклад, робити версталки або парсити бази даних для ефарників, робити міні програмки, які зможуть полегшити роботу моєї команди(для піарника я б зробив програму, яка робить таблицю занять студентів, де вказує на якій парі є ті чи інші групи, в якому корпусі та аудиторії, бо дивитися як піарник близько 4 годин робить це все сам прикро). Ну і про доступи в гугл диску не треба забувати, люди не рідко з цим мають проблеми). <br><br>Буду допомагати команді й в нетехнічних питаннях, наприклад ходити на інфостійки, ефарити та вирішувати різні задачі, тому що таски людей, які є в моїй кортімі, це не лише їх обов’язки - це все йде на благо нашого спільного івенту!  <br><br>Якщо все-таки, івент буде онлайн(молюсь Богу що такого не буде), то одними з моїх обов’язків буде менеджити зум, діскорд канал та створювати конференції.";
      } else {
        currentText = "Кт взяти не встиг, але обов’язково пройду всі, коли мене візьмуть. Поки знаю лише, що основна задача логіста це складання бюджету на сам івент. В бюджеті повинно бути вписано все - від бейджів до обідів. Я повинен: шукати стаф необхідний на івент; займатись друком всього що зробить дизайнер(і комунікувати з друкарнями), коли прийде час друку мерчу створити форми і замовити цей мерч; звітувати перед скарбником скільки я грошей витратив(буду вести таблицю і зберігати чеки, щоб скарбник міг зразу повернути всім гроші); Шукати плейс на проведення події з ефарниками, бо плейс на закриття/відкриття зазвичай ефариться; Скласти особистепланування що коли має бути зроблено.";
      }
  
      if (isBlockVisible && currentText === block2.innerHTML) {
        block2.classList.add("hidden");
        isBlockVisible = false;
      } else {
        block2.classList.remove("hidden");
        block2.innerHTML = currentText;
        isBlockVisible = true;
      }
    });
  });
  